[
  {
    "id": "ai-recipe-assistant",
    "name": "AI Recipe Assistant",
    "description": "A smart, AI-powered web application that helps users discover, plan, and customize recipes using artificial intelligence. Features personalized meal suggestions, nutrition insights, voice-controlled cooking assistance, and OCR-based recipe import.",
    "intro": "AI Recipe Assistant is a modern web application designed to revolutionize your cooking experience. It combines the power of AI with an intuitive interface to help home cooks, busy professionals, and anyone with dietary restrictions find, plan, and adapt recipes effortlessly.",
    "problem_solved": "Finding recipes that match personal preferences and dietary needs is time-consuming. Planning meals and shopping for ingredients is often a hassle. Adapting recipes for allergies, vegan, vegetarian, or gluten-free diets is challenging without expert help. This app solves all these problems by providing AI-powered recipe suggestions, intelligent meal planning, and instant cooking assistance.",
    "technologies": ["Next.js 15", "React 19", "TypeScript", "Tailwind CSS", "SWR", "Tesseract.js (OCR)", "Groq AI", "OpenAI API", "Framer Motion", "Web Speech API", "Vercel"],
    "technical_details": "## Architecture\n\nBuilt with Next.js 15 and React 19 using TypeScript for type safety. Features a chatbot powered by Groq's LLM API (llama3-8b-8192 model) for AI cooking assistance.\n\n## Key Features\n\n- Voice recognition for hands-free cooking guidance with multi-language support (English, Spanish, French, German, Hindi, Chinese)\n- Tesseract.js OCR to extract recipes from images\n- Step-by-step voice-guided cooking\n- Recipe modification assistant for dietary adaptations\n- Nutrition calculator and meal planning context\n- State management through React Context API with SWR for efficient data caching\n- Styled with Tailwind CSS and Framer Motion for smooth animations",
    "githubUrl": "https://github.com/FawwazRaza/AI-Recipe-Helper",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "enterprise-rag-chatbot",
    "name": "Enterprise RAG Chatbot for Financial Document Analysis",
    "description": "It uses a Retrieval-Augmented Generation (RAG) system that combines document search and AI response generation. Users can upload documents such as PDF, DOCX, TXT, and CSV. The chatbot checks for duplicates, tracks progress, and logs all uploads. A hybrid retriever searches documents using both keyword and meaning-based search. The AI model then generates answers, summaries, and calculations such as IRR, NPV, and fund KPIs.",
    "intro": "It is an AI-based chatbot designed for financial document analysis and wealth management support. It allows users to chat, upload financial reports, and receive insights instantly. The chatbot combines document retrieval with AI models to assist in due diligence, risk checks, and investment performance analysis. It offers a complete solution for finance teams and investors to analyze data through simple conversations.",
    "problem_solved": "Financial analysis and due diligence require going through long reports and complex spreadsheets. This process takes time and may lead to human errors. It automates these steps by reading financial documents, detecting duplicates, calculating key investment metrics, and generating analysis summaries. It helps professionals save time, reduce errors, and maintain accurate audit trails for decisions.",
    "technologies": ["Python", "FastAPI", "Streamlit", "Groq API", "Pinecone Vector Database", "Vector Databases", "Embedding Models", "Semantic Search"],
    "technical_details": "## Retrieval System\n\nUses `HybridRetriever` with Pinecone vector database and BM25 keyword scoring for hybrid search.\n\n## Financial Tools\n\nIncludes modules like `FundKPIExtractor`, `FinancialTools`, and `AdvancedToolExecutor` for IRR, NPV, TVPI, DPI, and stress tests.\n\n## Document Processing\n\nHandled by `DocumentChunker` and `DocumentChunkingPipeline` classes for cleaning, sentence splitting, and chunk formation.\n\n## Additional Features\n\n- Financial metric extraction (cash flows, NAV, fund size, fees)\n- Peer group comparison and ranking\n- Risk-adjusted performance and attribution analysis\n- Visual dashboards for KPIs, stress tests, and J-curve projections\n- Conversation summarization and context management\n- API endpoints for health checks, uploads, chats, and duplicate checks",
    "githubUrl": "",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "open-journal-system",
    "name": "Open Journal System (OJS)",
    "description": "The Open Journal System includes complete editorial and publishing workflows with user roles and dashboards for admin, editor, reviewer, author, proofreader, and publisher. It manages submission and review flow, editorial workflow, proofreading and blind review, email notifications, and OAI-PMH metadata export.",
    "intro": "This is a web-based platform used to manage and publish academic journals. It allows authors to submit research articles, reviewers to give feedback, editors to manage the review process, and publishers to publish issues. The system provides all steps of journal management in one place — from submission to publication.",
    "problem_solved": "Managing research papers and reviews by email or manually can cause confusion, delays, and errors. This system solves these problems by creating one online space where all roles — author, reviewer, editor, and publisher — can work together easily. It helps universities, publishers, and journals save time and maintain accurate records.",
    "technologies": ["PHP", "MySQL", "HTML", "CSS", "JavaScript", "XAMPP (Apache + MySQL)", "Google OAuth"],
    "technical_details": "## Functions Implemented\n\n- `check_user_session()` → verifies active login session\n- `doi-functions.php` → handles DOI generation for articles\n- `metadata-functions.php` → manages article metadata fields\n- `seo-functions.php` → improves visibility of published articles\n- `stats-functions.php` → calculates submission and review statistics\n\n## Database Tables\n\nStored in `ojs_complete_schema.sql` including users, roles, articles, reviews, and decisions\n\n## Key Features\n\n- Automation: Proofreading and reviewer assignment automation scripts\n- Logging and Audit Trails: Logs stored in `/logs` with timestamp entries\n- Localization Support: Multi-language support using `/languages/en.php` and `/languages/ur.php`\n- Email Handling: Automatic verification and role-based notifications\n- OAI-PMH Protocol Support: Implements standard Dublin Core metadata export",
    "githubUrl": "",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "livekit-voice-agent",
    "name": "LiveKit Voice Agent – Outbound Call System",
    "description": "The system runs on FastAPI and connects with Twilio to place real phone calls. The voice agent uses LiveKit for real-time audio streaming between the user and AI. Speech is recognized using Deepgram (speech-to-text), and responses are generated using Groq LLM. The voice output is created with ElevenLabs (text-to-speech).",
    "intro": "This project is a voice-based AI calling system that can make outbound phone calls using Twilio and LiveKit. The agent can speak, listen, and respond to users in real time using speech recognition, a language model, and text-to-speech. It acts like a virtual assistant that can start phone conversations and handle meeting or service calls automatically.",
    "problem_solved": "Businesses often spend time and money on manually making phone calls for reminders, confirmations, and customer support. This system solves that problem by allowing an AI agent to make these calls automatically, respond naturally, and handle basic conversations without human help.",
    "technologies": ["Python", "FastAPI", "Twilio API", "LiveKit", "Deepgram API", "Groq API", "ElevenLabs API", "Speech-to-Text"],
    "technical_details": "## Voice Workflow\n\nConverts live user speech → text (Deepgram) → response (Groq LLM) → voice (ElevenLabs)\n\n## Call Control Functions\n\n- `make_outbound_call()` – Starts a new outbound phone call\n- `hangup_call()` – Ends an ongoing call\n- `end_call()` – Final cleanup of session and resources\n\n## Session Management\n\n- `close_agent_sessions()` ensures the LiveKit session ends safely after a call\n- `get_livekit_api()` manages connection to LiveKit servers\n\n## Configuration\n\nEnvironment Variables control all API keys, call duration (`RESPONSE_TIMEOUT`), voice tone (`ELEVENLABS_VOICE_ID`), and chat memory (`MAX_CONVERSATION_HISTORY`)",
    "githubUrl": "",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "queryclip",
    "name": "QueryClip",
    "description": "A RAG video chatbot to deliver accurate, context-aware answers. Users can upload videos, which are split into chunks and embedded into a vector database. When a question is asked, the chatbot retrieves relevant chunks using similarity search and generates response.",
    "intro": "AI-powered video analysis chatbot that understands and answers questions about video content using advanced RAG techniques.",
    "problem_solved": "Users struggled to find specific information within long video content, requiring manual scrubbing and watching entire videos.",
    "technologies": ["Python", "Streamlit", "Langchain", "ChromaDB", "Vector Databases", "ngrok", "FastAPI", "Groq API", "Speech-to-Text", "Embedding Models", "Semantic Search"],
    "technical_details": "## Architecture\n\nBuilt using Retrieval-Augmented Generation (RAG) pattern for intelligent video content analysis.\n\n## Key Features\n\n- Video chunking and embedding\n- Semantic similarity search using ChromaDB\n- Context-aware response generation\n- Speech-to-text integration",
    "githubUrl": "https://github.com/FawwazRaza/QueryClip",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "deepfetch",
    "name": "DeepFetch – RAG-Based AI Chatbot",
    "description": "DeepFetch reads and processes files like PDF, Word, and Markdown. It breaks the text into smaller parts and saves them in a database for quick search. When a user asks a question, the system finds the most related text pieces and sends them to an AI model called Mistral-7B. The model then generates a response using the document content and the question.",
    "intro": "DeepFetch is an AI chatbot that can answer questions using both stored documents and an AI language model. It understands the user's query, finds useful information from documents, and then gives a clear and accurate answer. The chatbot is built to make information search easier and faster.",
    "problem_solved": "People often have large amounts of information stored in documents but find it hard to quickly get the right answers. This project solves that problem by allowing the chatbot to first search documents and then use AI to give direct, helpful replies.",
    "technologies": ["Python", "Streamlit", "Langchain", "ChromaDB", "Vector Databases", "FastAPI", "Embedding Models", "Semantic Search"],
    "technical_details": "## Document Processing Pipeline\n\n- Supports PDF, Word, and Markdown formats\n- Intelligent text chunking for optimal retrieval\n- Vector embedding using ChromaDB\n\n## AI Integration\n\n- Powered by Mistral-7B language model\n- Context-aware response generation\n- FastAPI backend with Streamlit frontend",
    "githubUrl": "https://github.com/FawwazRaza/DeepFetch_RAG_chatbot",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "magnum-opsem",
    "name": "Magnum-opsem",
    "description": "Magnum-opsem is a cutting-edge e-commerce platform designed for unparalleled customization and seamless user experience. Built with React, SCSS, HTML, and other modern technologies, it offers dynamic features like location-based ordering, customizable headers and footers, and an intuitive product catalog.",
    "intro": "Feature-rich e-commerce platform with advanced customization capabilities and location-aware services.",
    "problem_solved": "Traditional e-commerce solutions lacked flexibility for businesses needing location-based features and extensive UI customization.",
    "technologies": ["React JS", "redux", "material UI", "Bootstrap", "SCSS", "HTML", "Javascript", "Express Js", "Node Js", "CSS", "Git", "GitHub"],
    "technical_details": "## Frontend Architecture\n\n- React.js with Redux state management\n- Material UI and Bootstrap for responsive design\n- SCSS for advanced styling\n\n## Key Features\n\n- Location-based ordering system\n- Customizable UI components\n- Product catalog management\n- Express.js backend integration",
    "githubUrl": "https://github.com/FawwazRaza/magnum-opsem",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "ecommerce-chatbot",
    "name": "Advanced E-commerce Product Recommendation Chatbot",
    "description": "Implemented semantic search, NLP, and location-aware product recommendations for efficient product discovery.",
    "intro": "AI-powered chatbot that provides intelligent product recommendations based on semantic understanding and user location.",
    "problem_solved": "Traditional search methods in e-commerce fail to understand user intent and context, leading to poor product discovery.",
    "technologies": ["Python", "OpenAI API", "ChromaDB", "FastAPI", "NumPy", "SciPy", "Langchain", "Scikit-Learn"],
    "technical_details": "## NLP Pipeline\n\n- Semantic search using OpenAI embeddings\n- Location-aware recommendations\n- Vector similarity matching with ChromaDB\n\n## Implementation\n\n- FastAPI REST API\n- Real-time product matching\n- Context-aware conversational interface",
    "githubUrl": "https://github.com/FawwazRaza/AI-chatbot-integrated-in-ecommerce-website",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "medical-conversation",
    "name": "Medical Conversation Analysis Tool",
    "description": "This project provides a comprehensive suite of tools for processing and analyzing medical conversations between doctors and patients. It leverages cutting-edge natural language processing techniques to transcribe audio, classify speaker roles, and generate concise summaries.",
    "intro": "NLP-powered tool for analyzing medical conversations with speaker classification and automated summarization.",
    "problem_solved": "Medical professionals need efficient ways to document and analyze patient conversations for records and insights.",
    "technologies": ["Python", "Hugging face models", "speaker classification", "conversation summarization", "medical conversations"],
    "technical_details": "## NLP Features\n\n- Audio transcription\n- Speaker role classification (doctor/patient)\n- Automated conversation summarization\n- Medical terminology recognition\n\n## Technology Stack\n\nHugging Face transformers for state-of-the-art NLP capabilities",
    "githubUrl": "https://github.com/FawwazRaza/Medical-Conversation-Analysis-Tool",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "ecocommute",
    "name": "EcoCommute Carpooling Solution",
    "description": "EcoCommute reduces parking, traffic, and carbon emissions in universities through a carpooling platform with driver/rider profiles, ride searches, and safety options.",
    "intro": "Sustainable transportation platform connecting university students for carpooling to reduce environmental impact.",
    "problem_solved": "University campuses face parking congestion, traffic, and high carbon emissions from individual commuting.",
    "technologies": ["Django", "Python", "HTML", "CSS", "JavaScript", "SQLite3"],
    "technical_details": "## Platform Features\n\n- Driver and rider profile management\n- Ride matching algorithm\n- Safety verification system\n- Real-time ride search\n\n## Implementation\n\nDjango full-stack application with SQLite database",
    "githubUrl": "https://github.com/FawwazRaza/Eco_commute",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "ai-projects",
    "name": "AI Projects",
    "description": "AI Projects repository! This repository serves as a collection of my latest AI-related projects, showcasing various techniques, models, and applications in artificial intelligence.",
    "intro": "Comprehensive collection of AI/ML projects demonstrating various techniques and applications.",
    "problem_solved": "Centralized showcase of diverse AI implementations and experimentation.",
    "technologies": ["LLM chain", "AI", "ML", "Python", "Pandas", "Numpy", "Scikit-learn", "Matplotlib", "Hugging Face", "Open-Source Models"],
    "technical_details": "## Project Scope\n\n- Machine learning model implementations\n- LLM chain applications\n- Data analysis and visualization\n- Open-source model integration\n\n## Tools & Libraries\n\nPandas, NumPy, Scikit-learn, Matplotlib, Hugging Face",
    "githubUrl": "https://github.com/FawwazRaza/AI-projects",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "web-dev-tasks",
    "name": "Web-Development-Tasks",
    "description": "My portfolio is a website built with React.js and Tailwind CSS, utilizing React Router v6 to enable easy access to multiple pages. It was designed and created entirely by myself, showcasing my skills and projects. The website is responsive and visually appealing, providing a user-friendly experience.",
    "intro": "Personal portfolio showcasing web development skills with modern React and Tailwind CSS.",
    "problem_solved": "Need for a professional online presence to showcase projects and skills.",
    "technologies": ["React JS", "Tailwind CSS", "Git", "GitHub", "HTML", "CSS", "Javascript"],
    "technical_details": "## Technical Implementation\n\n- React.js with React Router v6\n- Tailwind CSS for styling\n- Responsive design principles\n- Git version control\n\n## Features\n\nMulti-page navigation, project showcase, responsive layout",
    "githubUrl": "https://github.com/FawwazRaza/Web-Development-Tasks",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "tetris-game",
    "name": "Tetris game",
    "description": "A feature-rich Tetris game implementation using Assembly language, offering classic gameplay with modern twists and enhanced features.",
    "intro": "Classic Tetris game implemented in Assembly 8088 architecture.",
    "problem_solved": "Low-level game programming demonstration with Assembly language.",
    "technologies": ["Assembly", "Assembly 8088"],
    "technical_details": "## Implementation\n\n- Assembly 8088 architecture\n- Classic Tetris mechanics\n- Direct hardware manipulation\n- Game loop and rendering\n\n## Learning Goals\n\nLow-level programming, hardware interaction, game logic",
    "githubUrl": "https://github.com/FawwazRaza/Tetris-game-assembly-language-8088-architecture",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "gari-gator",
    "name": "Gari-Gator Website",
    "description": "The E-Commerce Website project is a comprehensive online shopping platform designed to offer a seamless and dynamic shopping experience similar to major e-commerce sites like Amazon. Built with ASP.NET and C#, and using MySQL for database management, this platform supports features like product browsing, user authentication, shopping cart management, and order processing.",
    "intro": "Full-featured e-commerce platform built with ASP.NET and MySQL.",
    "problem_solved": "Need for a complete e-commerce solution with robust backend and database management.",
    "technologies": ["HTML", "CSS", "JavaScript", "ASP.NET", "C#", "MySQL"],
    "technical_details": "## E-Commerce Features\n\n- Product catalog and browsing\n- User authentication and authorization\n- Shopping cart management\n- Order processing system\n\n## Technology Stack\n\nASP.NET backend with C#, MySQL database, HTML/CSS/JavaScript frontend",
    "githubUrl": "https://github.com/FawwazRaza/DB-lab/blob/main/DB%20lab%20(SQL)/DBLABPROJECT.zip",
    "liveLink": "",
    "image": ""
  },
  {
    "id": "dodge-em-game",
    "name": "Dodge 'Em Game",
    "description": "Welcome to Dodge 'Em Game! Experience the thrill of classic arcade gaming with Dodge 'Em, developed by Carla Meninsky in 1980. Control a brown car, navigate a maze, collect rewards, and avoid collisions with blue opponent cars. With progressive difficulty levels, strategic gameplay, and a nostalgic feel, Dodge 'Em promises endless fun and challenge.",
    "intro": "Classic arcade game recreation in C++ with maze navigation and collision avoidance.",
    "problem_solved": "Recreation of classic arcade gaming experience with modern C++ implementation.",
    "technologies": ["C++"],
    "technical_details": "## Game Mechanics\n\n- Maze navigation system\n- Collision detection\n- Progressive difficulty\n- Score tracking\n\n## Implementation\n\nC++ game logic with classic arcade-style gameplay",
    "githubUrl": "https://github.com/FawwazRaza/Dodge-Em-Game-c-plus-plus",
    "liveLink": "",
    "image": ""
  }
]
